org-irc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-06-15 Tue 18:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Org Internet Relay Chat (IRC)</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Worg people" />
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/htmlize.css"/>
 <link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="https://orgmode.org/worg/"> HOME </a>
</div><div id="content">
<h1 class="title">Org Internet Relay Chat (IRC)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5b86998">Internet Relay Chat (IRC)</a></li>
<li><a href="#org04f5e04">Nickname Registration</a></li>
<li><a href="#org0713c3d">IRC Guidelines</a></li>
<li><a href="#orgb5e572f">IRC Clients</a></li>
</ul>
</div>
</div>

<div id="outline-container-org5b86998" class="outline-2">
<h2 id="org5b86998">Internet Relay Chat (IRC)</h2>
<div class="outline-text-2" id="text-org5b86998">
<p>
Like many Free Software projects Org has an active IRC channel on the
Freenode IRC network. IRC is a form of real time chat with other users
who join the network and are participating in the channel.
</p>

<ul class="org-ul">
<li>Org IRC channel details
<dl class="org-dl">
<dt>Network</dt><dd><a href="https://freenode.net/">https://freenode.net/</a></dd>
<dt>IRC Server</dt><dd>chat.freenode.net</dd>
<dt>Channel</dt><dd>#org-mode</dd>
</dl></li>
</ul>
</div>
</div>

<div id="outline-container-org04f5e04" class="outline-2">
<h2 id="org04f5e04">Nickname Registration</h2>
<div class="outline-text-2" id="text-org04f5e04">
<p>
<b>UPDATE (September 2020):</b> We are currently experimenting with lifting
the freenode account registration requirement for <code>#org-mode</code>.  As of
now, registering an account is <i>not</i> required for joining the channel.
If this experiment goes well, we will continue to not require an
account.  Watch this space for future updates.
</p>

<p>
Currently you must have a registered nickname with Freenode to join
the Org channel.
</p>

<p>
Please see instructions at: <a href="https://freenode.net/kb/answer/registration">https://freenode.net/kb/answer/registration</a>
</p>
</div>
</div>

<div id="outline-container-org0713c3d" class="outline-2">
<h2 id="org0713c3d">IRC Guidelines</h2>
<div class="outline-text-2" id="text-org0713c3d">
<p>
IRC is a highly asynchronous form of chat. If the channel is not busy,
don&rsquo;t be discouraged. Users come and go and watch the history.
</p>

<p>
When you join the channel, there is no need to ask whether you can ask
a question. Please ask directly what you would like to discuss, and
wait for a reply. You may wait quite some time so don&rsquo;t ask and quit
five minutes later.
</p>

<p>
Be polite and respect other users. Rude behavior and spam are not
tolerated.
</p>

<p>
Examples of etiquette guides from other channels:
</p>

<ul class="org-ul">
<li><a href="https://freenode.net/changuide">https://freenode.net/changuide</a></li>
<li><a href="https://wiki.ubuntu.com/IRC/Guidelines">https://wiki.ubuntu.com/IRC/Guidelines</a></li>
</ul>

<p>
Please consider using a privacy friendly paste service for posting
code, like <a href="http://bpaste.net/">http://bpaste.net/</a> .
</p>
</div>
</div>

<div id="outline-container-orgb5e572f" class="outline-2">
<h2 id="orgb5e572f">IRC Clients</h2>
<div class="outline-text-2" id="text-orgb5e572f">
<ul class="org-ul">
<li>Emacs IRC (ERC): <a href="https://www.gnu.org/software/emacs/erc.html">https://www.gnu.org/software/emacs/erc.html</a></li>
<li>Irssi</li>
<li>Freenode has a web client at: <a href="https://webchat.freenode.net/">https://webchat.freenode.net/</a></li>
<li>plenty of other clients, search for your OS and IRC client</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Worg people</p>
<p class="date">Created: 2021-06-15 Tue 18:21</p>
</div>
</body>
</html>
